Revit 2027 API
BRepBuilderEdgeGeometry.Create Method
Overload List
Name | Description
Create(Curve) |  Construct BRepBuilderEdgeGeometry based on any Revit Curve, including Line and Arc. The curve will be simplified if possible.
Create(XYZ, XYZ) |  Constructs a BRepBuilderEdgeGeometry representing a straight line between the two given points.
Top
See Also
Reference
BRepBuilderEdgeGeometry Class
Autodesk.Revit.DB Namespace